12emilia21/Fault-Location-Implementation/buck_converter_dma_original/c2000.syscfg
dma4.$name                  = "myDMA3";
dma4.dmaBase                = "DMA_CH4_BASE";
dma4.useInterrupts          = true;
dma4.registerInterrupts     = true;
dma4.enableInterrupts       = true;
dma4.interruptMode          = "DMA_INT_AT_END";
dma4.srcAddressInputMode    = "VARIABLE";
dma4.srcBurstStep           = 1;
dma4.triggerSource          = "DMA_TRIGGER_ADCC2";
dma4.srcAddressVariable     = "VO_data_source";
dma4.destAddressInputMode   = "VARIABLE";
dma4.destAddressVariable    = "VO_data_dest";
dma4.enableTriggers         = true;
dma4.startChannel           = true;
dma4.continuousModeConfig   = "DMA_CFG_CONTINUOUS_ENABLE";
dma4.burstSize              = 2;
dma4.destBurstStep          = 1;
dma4.srcWrapSize            = 65536;
dma4.destWrapStep           = -128;
dma4.destWrapSize           = 128;
dma4.srcTransferStep        = -1;
dma4.transferSize           = 127;
dma4.dmaInt.enableInterrupt = true;

dma5.$name                  = "myDMA4";
dma5.dmaBase                = "DMA_CH5_BASE";
dma5.enableTriggers         = true;
dma5.useInterrupts          = true;
dma5.registerInterrupts     = true;
dma5.enableInterrupts       = true;
dma5.interruptMode          = "DMA_INT_AT_END";
dma5.srcAddressInputMode    = "VARIABLE";
dma5.srcAddressVariable     = "IO_data_source";
dma5.srcBurstStep           = 1;
dma5.destAddressInputMode   = "VARIABLE";
dma5.destAddressVariable    = "IO_data_dest";
dma5.startChannel           = true;
dma5.continuousModeConfig   = "DMA_CFG_CONTINUOUS_ENABLE";
dma5.destBurstStep          = 1;
dma5.srcTransferStep        = -1;
dma5.triggerSource          = "DMA_TRIGGER_ADCB2";
dma5.burstSize              = 2;
dma5.destWrapSize           = 128;
dma5.destWrapStep           = -128;
dma5.transferSize           = 127;
dma5.dmaInt.enableInterrupt = true;

epwm.enableInfo    = true;
epwm.enableWarning = true;

epwm1.generateCodeTemplate                                       = true;
epwm1.$name                                                      = "ControlPWM";
epwm1.epwmCounterCompare_enableShadowLoadModeCMPB                = false;
epwm1.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmActionQualifier_t1Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm1.epwmActionQualifier_t2Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm1.epwmActionQualifier_continousSwForceReloadModeGld          = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm1.epwmCounterCompare_enableShadowLoadModeCMPA                = false;
epwm1.useInterfacePins                                           = ["EPWM#_A"];
epwm1.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmTimebase_periodGld                                     = true;
epwm1.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.hrpwm_enable                                               = true;
epwm1.hrpwm_autoConv                                             = true;
epwm1.hrpwm_enableCalculator                                     = true;
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar          = "1";
epwm1.epwmEventTrigger_enableInterrupt                           = true;
epwm1.epwmEventTrigger_registerInterrupts                        = true;
epwm1.epwmEventTrigger_interruptEventCount                       = "1";
epwm1.epwmEventTrigger_interruptEventCountInitForce              = true;
epwm1.epwmDeadband_delayRED                                      = 20;
epwm1.epwmDeadband_delayFED                                      = 20;
epwm1.epwmActionQualifier_continousSwForceReloadMode             = "EPWM_AQ_SW_IMMEDIATE_LOAD";
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_PERIOD";
epwm1.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm1.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_U_CMPB";
epwm1.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm1.hrpwm_syncSource                                           = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm1.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_T1_COUNT_UP        = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmDeadband_enableRED                                     = true;
epwm1.epwmDeadband_enableFED                                     = true;
epwm1.epwmTimebase_period                                        = 5000;
epwm1.epwmCounterCompare_cmpA                                    = 2500;
epwm1.epwmCounterCompare_cmpB                                    = 4999;
epwm1.epwm.$assign                                               = "EPWM1";
epwm1.epwm.epwm_aPin.$assign                                     = "ball.79";
epwm1.epwm.epwm_bPin.$assign                                     = "ball.78";
epwm1.epwmInt.enableInterrupt                                    = true;

epwm2.$name                                                      = "ControlPWM_2fsw";
epwm2.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm2.hrpwm_syncSource                                           = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm2.epwmActionQualifier_continousSwForceReloadModeGld          = true;
epwm2.epwmActionQualifier_t1Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm2.epwmActionQualifier_t2Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm2.epwmActionQualifier_continousSwForceReloadMode             = "EPWM_AQ_SW_IMMEDIATE_LOAD";
epwm2.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm2.hrpwm_enable                                               = true;
epwm2.hrpwm_autoConv                                             = true;
epwm2.hrpwm_enableCalculator                                     = true;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_T1_COUNT_UP        = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmTimebase_periodGld                                     = true;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPA                = false;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPB                = false;
epwm2.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm2.epwmDeadband_delayRED                                      = 10;
epwm2.epwmDeadband_delayFED                                      = 10;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm2.epwmDeadband_enableFED                                     = true;
epwm2.epwmDeadband_enableRED                                     = true;
epwm2.epwmTimebase_period                                        = 2500;
epwm2.epwmCounterCompare_cmpA                                    = 1250;
epwm2.epwmCounterCompare_cmpB                                    = 2499;
epwm2.epwm.$assign                                               = "EPWM2";
epwm2.epwm.epwm_aPin.$assign                                     = "ball.77";
epwm2.epwm.epwm_bPin.$assign                                     = "ball.76";

gpio1.$name             = "debug_pin";
gpio1.writeInitialValue = true;
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.initialValue      = 1;
gpio1.gpioPin.$assign   = "ball.53";

gpio2.direction                 = "GPIO_DIR_MODE_OUT";
gpio2.useInterrupt              = true;
gpio2.$name                     = "transient_det_pin";
gpio2.xint.intType              = "GPIO_INT_TYPE_RISING_EDGE";
gpio2.xint.enableInt            = true;
gpio2.xint.registerInterrupts   = true;
gpio2.xint.xInt.enableInterrupt = true;

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
gpio2.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO28";

memcfg.init_MEMCFG_SECT_MSGCPUTOCLA1 = true;
memcfg.init_MEMCFG_SECT_MSGCLA1TOCPU = true;

FPUfastRTS1.$name = "myFFR0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio2.gpioPin.$suggestSolution = "ball.1";
